# WallCutoutForInsertionFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..WallCutoutForInsertionFailure Property
BuiltInFailures..::..WallFailures Class See Also
---
Can't cut wall for inserted objects
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WallCutoutForInsertionFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallCutoutForInsertionFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WallCutoutForInsertionFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace